export const REGEX = {
  EMAIL: /^([a-zA-Z0-9])+([a-zA-Z0-9._-])*@([a-zA-Z0-9_-])+([a-zA-Z0-9._-]+)+$/,
  PASSWORD: /(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])[A-Za-z0-9!"#$%&'()\-^@;:,./=~|{+*}<>?_]/,
  YMD: /^\d{4}-\d{2}-\d{2}$/,
  YMDHMS: /^\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}$/,
  PHONE:
    /^(((\d{2}-\d{4})|(\d{3}-\d{3,4})|(\d{4}-\d{2})|(\d{5}-\d{1}))-\d{4})|(\d{4}-\d{3}-\d{3})$|^(090|080|070)-\d{4}-\d{4}$/,
};

export const YUP_MESSAGES = {
  EMAIL: '有効なメールアドレスを入力してください。',
  PHONE: '有効な電話番号を入力してください。',
  PASSWORD_MIN: 'パスワードは8桁以上で設定ください。',
  PASSWORD_MAX: 'パスワードは20桁以内で設定ください。',
  PASSWORD_MATCHES:
    'パスワードは大文字、小文字、数字をそれぞれ1つ以上使用し、半角8文字以上で設定してください。',
  PASSWORD_CONFIRM: 'パスワードとパスワード（確認用）が一致していません',
};
